package com.javarush.test.level03.lesson06.task03;

/* Семь цветов радуги
Выведи на экран текст - семь цветов радуги.
В каждой строке должно быть по три цвета, в последней - один.
Цвета в строках разделяй пробелом.
Запомни: буквы Ё в тестах нигде нет.
Чтобы тесты проходили правильно, во всех задачах заменяй Ё на Е.
*/

public class Solution
{
    public static void main(String[] args)
    {

        String[] s  = {"Красный","Оранжевый","Желтый","Зеленый","Голубой","Синий","Фиолетовый"};
//    	String[] s  = {"красный","оранжевый","желтый","зеленый","голубой","синий","фиолетовый"};
//      String[] s  = {"КРАСНЫЙ","ОРАНЖЕВЫЙ","ЖЕЛТЫЙ","ЗЕЛЕНЫЙ","ГОЛУБОЙ","СИНИЙ","ФИОЛЕТОВЫЙ"};
//      String[] s  = {"red","orange","yellow","green","blue","indigo","violet"};

        System.out.println(s[0] + " " + s[1] + " " + s[2]);
        System.out.println(s[3] + " " + s[4] + " " + s[5]);
        System.out.println(s[6]);
    }
    //Напишите тут ваш код

}
